Конфигурация/Reports/ЖурналыВходящихИсходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ЖурналыВходящихИсходящихДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Reports/ЖурналыВходящихИсходящихДокументов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.ПериодОтчета.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	
	СоздатьРеквизитыИЭлементыФормы(ПолучитьСтруктуруОтчета());
	
	ЭтаФорма.ТекущаяСтраница = "ВходящиеДокументы";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// для первого запуска отчета
	Если Не ЭтаФорма.ФормаИнициализирована Тогда
		ИнициализироватьФормуНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// сохраним настройки каждого раздела
	Для каждого ЭлементСтруктуры Из ПолучитьСтруктуруОтчета() Цикл
		Настройки.Вставить("Настройки" + ЭлементСтруктуры, ЭтаФорма["Настройки" + ЭлементСтруктуры]);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	Для каждого ЭлементСтруктуры Из ПолучитьСтруктуруОтчета() Цикл
		
		УстановитьТекущийВариант(ЭлементСтруктуры);
		
		// создаем элементы управления для настроек отчета
		СоздатьЭлементыФормыПользовательскихНастроек(Элементы["Настройки" + ЭлементСтруктуры],, 3);
		УстановитьДействияЭлементовОтбора(Элементы["Настройки" + ЭлементСтруктуры]);
		
		// сохраняем настройки в реквизиты формы
		ЭтаФорма["Настройки" + ЭлементСтруктуры] = Настройки.Получить("Настройки" + ЭлементСтруктуры);
		
	КонецЦикла;
	
	ЭтаФорма.ФормаИнициализирована = Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	
	Для каждого ЭлементСтруктуры Из ПолучитьСтруктуруОтчета() Цикл
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат" + ЭлементСтруктуры], "НЕАКТУАЛЬНОСТЬ");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРазделыОтчетаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ЭтаФорма["Настройки" + ЭтаФорма.ТекущаяСтраница] = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	ЭлементСтруктуры = СтрЗаменить(Элементы.ГруппаРазделыОтчета.ТекущаяСтраница.Имя, "Группа", "");
	
	ЭтаФорма.ТекущаяСтраница = ЭлементСтруктуры;
	УстановитьТекущийВариант(ЭлементСтруктуры);
	
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ЭтаФорма["Настройки" + ЭлементСтруктуры]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтбораПриИзменении(Элемент)

	ИмяРаздела = ПолучитьИмяРаздела(Элемент);
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат" + ИмяРаздела], "НЕАКТУАЛЬНОСТЬ");
	ЭтаФорма["Настройки" + ИмяРаздела] = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	ЭтаФорма.СохраняемыеВНастройкахДанныеМодифицированы = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда 
		
		СтандартнаяОбработка = Ложь;
		ИмяРаздела = ПолучитьИмяРаздела(Элемент);
		Значение = ПолучитьЗначениеРасшифровки(ЭтаФорма["Расшифровка" + ИмяРаздела], Расшифровка);
		ПростыеТипы = Новый ОписаниеТипов("Строка, Число, Дата, Булево, Неопределено");
		Если ЗначениеЗаполнено(Значение) И Не ПростыеТипы.СодержитТип(ТипЗнч(Значение)) Тогда
			ОткрытьЗначение(Значение);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	ОчиститьСообщения();
	КомандаСформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьВExcel(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	Диалог.Фильтр = "Лист Excel2007-... (*.xlsx)|*.xlsx";
	
	Диалог.Показать(Новый ОписаниеОповещения("КомандаВыгрузитьВExcelЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиентеНаСервереБезКонтекста 
Функция ПолучитьСтруктуруОтчета()

	Возврат СтрРазделить("ВходящиеДокументы,ИсходящиеДокументы,ЖурналЖалобИОбращений", ",");

КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЗаголовкиРазделов()

	Возврат Новый Структура("ВходящиеДокументы,ИсходящиеДокументы,ЖурналЖалобИОбращений", "Входящие документы", "Исходящие документы", "Журнал жалоб и обращений");

КонецФункции

&НаСервере
Процедура СоздатьРеквизитыИЭлементыФормы(СтруктураОтчета)

	ЗаголовкиРазделов = ПолучитьЗаголовкиРазделов(); 
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеЭлементы = Новый Массив;
	
	Для каждого ЭлементСтруктуры Из СтруктураОтчета Цикл
	
		// реквизит формы для хранения пользовательских настроек
		ОписаниеТипов = Новый ОписаниеТипов("Неопределено");
		РеквизитФормы = Новый РеквизитФормы("Настройки" + ЭлементСтруктуры, ОписаниеТипов);
		
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
		
		// реквизит формы для вывода результата
		ОписаниеТипов = Новый ОписаниеТипов("ТабличныйДокумент");
		РеквизитФормы = Новый РеквизитФормы("Результат" + ЭлементСтруктуры, ОписаниеТипов);
		
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
		
		// реквизит формы для адреса расшифровки
		ОписаниеТипов = Новый ОписаниеТипов("Строка");
		РеквизитФормы = Новый РеквизитФормы("Расшифровка" + ЭлементСтруктуры, ОписаниеТипов);
		
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
		
		// группа - страница
		СвойстваЭлемента = Новый Структура;
		СвойстваЭлемента.Вставить("Имя", "Группа" + ЭлементСтруктуры);
		СвойстваЭлемента.Вставить("ТипЭлемента", Тип("ГруппаФормы"));
		СвойстваЭлемента.Вставить("Родитель", "ГруппаРазделыОтчета");
		СвойстваЭлемента.Вставить("Вид", ВидГруппыФормы.Страница);
		СвойстваЭлемента.Вставить("Заголовок", ЗаголовкиРазделов[ЭлементСтруктуры]);
		
		ДобавляемыеЭлементы.Добавить(СвойстваЭлемента);
		
		// группа пользовательских настроек
		СвойстваЭлемента = Новый Структура;
		СвойстваЭлемента.Вставить("Имя", "Настройки" + ЭлементСтруктуры);
		СвойстваЭлемента.Вставить("ТипЭлемента", Тип("ГруппаФормы"));
		СвойстваЭлемента.Вставить("Родитель", "Группа" + ЭлементСтруктуры);
		СвойстваЭлемента.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);
				
		ДобавляемыеЭлементы.Добавить(СвойстваЭлемента);
		
		// поле табличного документа
		СвойстваЭлемента = Новый Структура;
		СвойстваЭлемента.Вставить("Имя", "Результат" + ЭлементСтруктуры);
		СвойстваЭлемента.Вставить("ТипЭлемента", Тип("ПолеФормы"));
		СвойстваЭлемента.Вставить("Родитель", "Группа" + ЭлементСтруктуры);
		СвойстваЭлемента.Вставить("ПутьКДанным", "Результат" + ЭлементСтруктуры);
		СвойстваЭлемента.Вставить("Вид", ВидПоляФормы.ПолеТабличногоДокумента);
				
		ДобавляемыеЭлементы.Добавить(СвойстваЭлемента);
	
	КонецЦикла; 
	
	// добавляем реквизиты формы
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// заполним адреса в хранилищах для расшифровок
	Для каждого ЭлементСтруктуры Из СтруктураОтчета Цикл
		ЭтаФорма["Расшифровка" + ЭлементСтруктуры] = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	КонецЦикла; 
	
	// добавляем элементы формы
	Для каждого Элемент Из ДобавляемыеЭлементы Цикл
	
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить(Элемент.Имя, Элемент.ТипЭлемента, Элементы[Элемент.Родитель]);
		НовыйЭлемент.Вид = Элемент.Вид;
		
		Если Элемент.Свойство("ПутьКДанным") Тогда
			НовыйЭлемент.ПутьКДанным = Элемент.ПутьКДанным;
		КонецЕсли; 
		
		Если Элемент.Свойство("Заголовок") Тогда
			НовыйЭлемент.Заголовок = Элемент.Заголовок;
		Иначе
			Если Элемент.ТипЭлемента = Тип("ГруппаФормы") Тогда
				НовыйЭлемент.ОтображатьЗаголовок = Ложь;
				НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
			Иначе
				НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			КонецЕсли; 
		КонецЕсли; 
		
		// для табличных документов установим действие обработки расшифровки
		Если Элемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента Тогда
			НовыйЭлемент.УстановитьДействие("ОбработкаРасшифровки", "ДокументРезультатОбработкаРасшифровки");
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДействияЭлементовОтбора(Элемент)

	Для каждого ПодчиненныйЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
	
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") Тогда
			// устанавливаем действие для подчиненных элементов
			УстановитьДействияЭлементовОтбора(ПодчиненныйЭлемент);
		ИначеЕсли ТипЗнч(ПодчиненныйЭлемент) = Тип("ПолеФормы") Тогда
			ПодчиненныйЭлемент.УстановитьДействие("ПриИзменении", "ПолеОтбораПриИзменении");
		КонецЕсли; 
	
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРасшифровки(АдресВХарилище, Расшифровка)

	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресВХарилище);
	Возврат ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение;

КонецФункции

&НаСервере
Процедура КомандаСформироватьНаСервере()
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьПроведениеДокументов() Тогда
		УстановитьНеактуальностьТабличныхДокументов("Отчет не сформирован. В выбранном периоде есть непроведённые входящие документы");
		Возврат;
	КонецЕсли;
	
	Механизм = "Отчет.ЖурналыВходящихИсходящихДокументов.Форма.КомандаСформироватьНаСервере()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(РеквизитФормыВЗначение("Отчет"));
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	// помещаем текущие настройки в реквизит формы
	ЭтаФорма["Настройки" + ЭтаФорма.ТекущаяСтраница] = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	Для каждого ЭлементСтруктуры Из ПолучитьСтруктуруОтчета() Цикл
		
		// устанавливаем текущий вариант и загружаем его настройки настройки
		УстановитьТекущийВариант(ЭлементСтруктуры);
		Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ЭтаФорма["Настройки" + ЭлементСтруктуры]);
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючТекущегоВарианта", ЭлементСтруктуры);
		
		// формируем результат
		СкомпоноватьРезультат();
		
		// сохраняем данные расшифровки в хранилище для текущего раздела
		ДанныеРасшифровкиКД = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
		ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКД, ЭтаФорма["Расшифровка" + ЭлементСтруктуры]);
		
		// выводим результат в табличный документ текущего раздела
		ЭтаФорма["Результат" + ЭлементСтруктуры].Очистить();
		ЭтаФорма["Результат" + ЭлементСтруктуры].Вывести(ЭтаФорма.Результат);
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат" + ЭлементСтруктуры]);
		
	КонецЦикла; 

	// возвращаем вариант, соответсвующий текущей странице и загрузим настройки
	УстановитьТекущийВариант(ЭтаФорма.ТекущаяСтраница);
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ЭтаФорма["Настройки" + ЭтаФорма.ТекущаяСтраница]);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПроведениеДокументов()
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",	Отчет.Организация);
	Запрос.УстановитьПараметр("ДатаНачала",		Отчет.ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	Отчет.ПериодОтчета.ДатаОкончания);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВходящийДокумент.Ссылка КАК Ссылка,
		|	ВходящийДокумент.Отправитель КАК Отправитель,
		|	НЕ ВходящийДокумент.Проведен КАК ДокументНеПроведен,
		|	ВходящийДокумент.ТипВходящегоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыВходящихДокументов.ПустаяСсылка) КАК НеУказанТипДокумента,
		|	НЕ ВходящийДокумент.ПоЛицензииДУ
		|		И НЕ ВходящийДокумент.ПоЛицензииУКПИФ
		|		И НЕ ВходящийДокумент.ПоСобственнойДеятельностиУК КАК НеУказанВидЛицензии
		|ИЗ
		|	Документ.ВходящийДокумент КАК ВходящийДокумент
		|ГДЕ
		|	НЕ ВходящийДокумент.ПометкаУдаления
		|	И (НЕ ВходящийДокумент.Проведен
		|			ИЛИ ВходящийДокумент.ТипВходящегоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыВходящихДокументов.ПустаяСсылка)
		|			ИЛИ НЕ ВходящийДокумент.ПоЛицензииДУ
		|				И НЕ ВходящийДокумент.ПоЛицензииУКПИФ
		|				И НЕ ВходящийДокумент.ПоСобственнойДеятельностиУК)
		|	И ВходящийДокумент.Организация = &Организация
		|	И ВходящийДокумент.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДокументНеПроведен Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не проведён %1, отправитель - %2", Выборка.Ссылка, Выборка.Отправитель), Выборка.Ссылка,,, Отказ);
		КонецЕсли;	
		Если Выборка.НеУказанТипДокумента Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не указан тип документа: %1, отправитель - %2", Выборка.Ссылка, Выборка.Отправитель), Выборка.Ссылка,,, Отказ);
		КонецЕсли;	
		Если Выборка.НеУказанВидЛицензии Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не указан вид лицензии: %1, отправитель - %2", Выборка.Ссылка, Выборка.Отправитель), Выборка.Ссылка,,, Отказ);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура УстановитьНеактуальностьТабличныхДокументов(Текст)
	
	ЗаголовкиРазделов = ПолучитьЗаголовкиРазделов(); 
	Для Каждого ЭлементСтруктуры Из ПолучитьСтруктуруОтчета() Цикл
		ЭтаФорма["Результат" + ЭлементСтруктуры].Очистить();
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат" + ЭлементСтруктуры], "НЕАКТУАЛЬНОСТЬ", Текст); 
	КонецЦикла;			
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяРаздела(Элемент)

	// все элементы раздела находятся на странице с названием "Группа" + ИмяРаздела
	// ищем группу, возвращаем имя
	Если ТипЗнч(Элемент.Родитель) = Тип("ГруппаФормы") Тогда
		
		Если СтрНачинаетсяС(Элемент.Родитель.Имя, "Группа") Тогда
			ИмяРаздела = СтрЗаменить(Элемент.Родитель.Имя, "Группа", "");
		Иначе
			ИмяРаздела = ПолучитьИмяРаздела(Элемент.Родитель);
		КонецЕсли; 
		
		Возврат ИмяРаздела;
	
	КонецЕсли; 

КонецФункции
 
&НаКлиенте
Процедура КомандаВыгрузитьВExcelЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда 
		
		СтруктураОтчета = ПолучитьСтруктуруОтчета();
		ЗаголовкиРазделов = ПолучитьЗаголовкиРазделов(); 
		
		Пакет = Новый ПакетОтображаемыхДокументов;
		
		Для каждого ЭлементСтруктуры Из СтруктураОтчета Цикл
			Элемент = Пакет.Состав.Добавить(ПоместитьВоВременноеХранилище(ЭтаФорма["Результат" + ЭлементСтруктуры], УникальныйИдентификатор));
			Элемент.Наименование = ЗаголовкиРазделов[ЭлементСтруктуры];
		КонецЦикла;
		
		Попытка
			Пакет.Записать(Диалог.ПолноеИмяФайла, ТипФайлаПакетаОтображаемыхДокументов.xlsx);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать файл. Система сообщает:" + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Для каждого ЭлементСтруктуры Из ПолучитьСтруктуруОтчета() Цикл
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат" + ЭлементСтруктуры], "НЕАКТУАЛЬНОСТЬ");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФормуНаСервере()

	Для каждого ЭлементСтруктуры Из ПолучитьСтруктуруОтчета() Цикл
		УстановитьТекущийВариант(ЭлементСтруктуры);
		СоздатьЭлементыФормыПользовательскихНастроек(Элементы["Настройки" + ЭлементСтруктуры],, 3);
		УстановитьДействияЭлементовОтбора(Элементы["Настройки" + ЭлементСтруктуры]);
		ЭтаФорма["Настройки" + ЭлементСтруктуры] = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	КонецЦикла; 	

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.ПериодОтчета,, Истина, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.ПериодОтчета", Отказ); 	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
